Core/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктурныеЕдиницы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОсновноеПодразделение</name>
      <description>Основное подразделение</description>
    </items>
    <items>
      <name>ОсновнойСклад</name>
      <description>Основной склад</description>
    </items>
    <items>
      <name>ТранзитныйСклад</name>
      <description>ტრანზიტული საწყობი</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСтруктурнойЕдиницы</name>
    <type>
      <types>EnumRef.ТипыСтруктурныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрдерныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМОЛ</name>
    <comment>Подпись материально-ответственного лица</comment>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРознице</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценки</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОтходов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяОтходов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРозницеРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценкиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранзитныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/AccumulationRegisters/СуммовойУчетВРознице/СуммовойУчетВРознице.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СуммовойУчетВРознице</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ПоступлениеВКассу</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Enums/ТипыСтруктурныхЕдиниц/ТипыСтруктурныхЕдиниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтруктурныхЕдиниц</name>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>Розница</name>
  </enumValues>
  <enumValues>
    <name>РозницаСуммовойУчет</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/СтруктурныеЕдиницы/Forms/ФормаРедактированияСчетовУчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СчетУчетаВРознице = Параметры.СчетУчетаВРознице;
	СчетУчетаНаценки = Параметры.СчетУчетаНаценки;
	СчетУчетаВРозницеРегл = Параметры.СчетУчетаВРозницерегл;
	СчетУчетаНаценкиРегл = Параметры.СчетУчетаНаценкиРегл;
	СчетУчетаРегл = Параметры.СчетУчетаРегл;
	Ссылка = Параметры.Ссылка;
	
	Если ОтказИзменитьСчетУчета(Ссылка) Тогда
		Элементы.ГруппаСчетовУчета.Подсказка = НСтр("ka='ბაზაში არის მოძრაობები ამ საცალო ვაჭრობის წერტილის მიხედვით! აღრიცხვის დათვლის შეცვლა აკრძალულია!';ru='В базе есть движения по этой розничной точке! Изменение счета учета запрещено!';en='At the base there is movement on this retail outlet! Change in accounting account banned!'");
		Элементы.ГруппаСчетовУчета.Доступность = Ложь;
		Элементы.ПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
	ЭтоРозницаСуммовойУчет = Ссылка.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет;
	ТранзитныйСклад  = Ссылка.ТранзитныйСклад;
	РегламентированныйУчетСервер.УстановитьВидимостьУпрУчета(ЭтаФорма);
	
	Если  ТранзитныйСклад Тогда
		ЭтаФорма.Элементы.СчетУчетаВРознице.Видимость = Ложь;
		ЭтаФорма.Элементы.СчетУчетаВРозницеРегл.Видимость  = Ложь;
		ЭтаФорма.Элементы.СчетУчетаНаценки.Видимость = Ложь;
		ЭтаФорма.Элементы.СчетУчетаНаценкиРегл.Видимость  = Ложь;
	КонецЕсли;

	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЭтоРозницаСуммовойУчет И Не ТранзитныйСклад = Истина Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(, НСтр("ka='აღრიცხვის ანგარიშების რედაქტირება ხდება მხოლოდ თანხობრივი აღრიცხვის მქონე საცალო ვაჭრობისთვის!';ru='Счета учетов редактируются только для розницы с суммовым учетом!';en='for bookkeeping edited only for retailers with the accrual basis, taking into account!'"));
	КонецЕсли;
	
	Если  ТранзитныйСклад Тогда
		ЭтаФорма.Элементы.СчетУчетаНаценки.Видимость = Ложь;
		ЭтаФорма.Элементы.СчетУчетаНаценкиРегл.Видимость  = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СчетУчетаВРозницеПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаВРознице) Тогда
	//	СчетУчетаВРознице = ПредопределенноеЗначение("ПланСчетов.Управленческий.ТоварыПродукция");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаНаценкиПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаНаценки) Тогда
	//	СчетУчетаНаценки = ПредопределенноеЗначение("ПланСчетов.Управленческий.ТорговаяНаценка");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаРеглПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаВРознице) Тогда
	//	СчетУчетаВРознице = ПредопределенноеЗначение("ПланСчетов.Управленческий.ТоварыПродукция");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	СчетУчетаВРознице = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	СчетУчетаНаценки = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	СчетУчетаВРозницеРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	СчетУчетаНаценкиРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры // ПоУмолчанию()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция проверяет возможность изменения счета.
//
&НаСервере
Функция ОтказИзменитьСчетУчета(Ссылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СуммовойУчетВРознице.Период,
	|	СуммовойУчетВРознице.Регистратор,
	|	СуммовойУчетВРознице.НомерСтроки,
	|	СуммовойУчетВРознице.Активность,
	|	СуммовойУчетВРознице.ВидДвижения,
	|	СуммовойУчетВРознице.Организация,
	|	СуммовойУчетВРознице.СтруктурнаяЕдиница,
	|	СуммовойУчетВРознице.Валюта,
	|	СуммовойУчетВРознице.Сумма,
	|	СуммовойУчетВРознице.СуммаВал,
	|	СуммовойУчетВРознице.Себестоимость,
	|	СуммовойУчетВРознице.СодержаниеПроводки,
	|	СуммовойУчетВРознице.ДокументПродажи
	|ИЗ
	|	РегистрНакопления.СуммовойУчетВРознице КАК СуммовойУчетВРознице
	|ГДЕ
	|	СуммовойУчетВРознице.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено));
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции // ОтказИзменитьСчетУчета()

&НаКлиенте
Процедура ОповеститьОбИзмененииСчетовРасчетов()
	
	СтруктураПараметры = Новый Структура(
		"СчетУчетаВРознице, СчетУчетаНаценки, СчетУчетаВРозницеРегл, СчетУчетаНаценкиРегл, СчетУчетаРегл",
		СчетУчетаВРознице, СчетУчетаНаценки, СчетУчетаВРозницеРегл, СчетУчетаНаценкиРегл, СчетУчетаРегл
	);
	
	Оповестить("ИзменилисьСчетаСтруктурныеЕдиницы", СтруктураПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаВРозницеРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаВРозницеРегл) Тогда
		СчетУчетаВРозницеРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаВРозницеРегл, СчетУчетаВРознице);
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаНаценкиРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаНаценкиРегл) Тогда
		СчетУчетаНаценкиРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаНаценкиРегл, СчетУчетаНаценки);
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

#КонецОбласти
